In [1]:
import pandas as pd

df = pd.read_csv("../data/data.csv")
df.head()

,Age,Gender,Education,Income,Debt,Credit_Score,Loan_Amount,Loan_Term,Num_Credit_Cards,Payment_History,Employment_Status,Residence_Type,Marital_Status,Creditworthiness
0,56,Female,Master,149406,34089,581,49200,60,4,Bad,Unemployed,Rented,Single,1
1,69,Female,High School,78896,8626,648,20147,24,7,Good,Employed,Mortgaged,Married,1
2,46,Female,Master,119339,46281,329,41307,12,8,Bad,Unemployed,Owned,Single,1
3,32,Male,High School,131067,29403,816,19019,60,8,Bad,Employed,Owned,Single,1
4,60,Male,PhD,38001,30032,673,16317,36,4,Average,Employed,Rented,Married,0

In [5]:
df.shape

(12000, 14)

In [7]:

df.info()
df.describe()

<class 'pandas.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                12000 non-null  int64
 1   Gender             12000 non-null  str
 2   Education          12000 non-null  str
 3   Income             12000 non-null  int64
 4   Debt               12000 non-null  int64
 5   Credit_Score       12000 non-null  int64
 6   Loan_Amount        12000 non-null  int64
 7   Loan_Term          12000 non-null  int64
 8   Num_Credit_Cards   12000 non-null  int64
 9   Payment_History    12000 non-null  str
 10  Employment_Status  12000 non-null  str
 11  Residence_Type     12000 non-null  str
 12  Marital_Status     12000 non-null  str
 13  Creditworthiness   12000 non-null  int64
dtypes: int64(8), str(6)
memory usage: 1.3 MB

,Age,Income,Debt,Credit_Score,Loan_Amount,Loan_Term,Num_Credit_Cards,Creditworthiness
count,12000.000000,12000.000000,12000.000000,12000.000000,12000.000000,12000.000000,12000.000000,12000.000000
mean,43.489250,85222.009417,25354.673250,573.967583,25113.951250,35.943000,4.985833,0.702583
std,14.908982,37640.043409,14087.390846,157.816052,14247.092051,16.965162,2.593458,0.457140
min,18.000000,20026.000000,1001.000000,300.000000,501.000000,12.000000,1.000000,0.000000
25%,31.000000,52400.750000,13161.000000,437.000000,12725.000000,24.000000,3.000000,0.000000
50%,43.000000,85756.000000,25382.500000,574.000000,25220.500000,36.000000,5.000000,1.000000
75%,56.000000,117754.750000,37497.500000,709.000000,37348.000000,48.000000,7.000000,1.000000
max,69.000000,149984.000000,49995.000000,849.000000,49996.000000,60.000000,9.000000,1.000000

In [ ]:
df["Creditworthiness"].value_counts(normalize=True)

Creditworthiness
1    0.702583
0    0.297417
Name: proportion, dtype: float64

In [9]:
for col in ["Gender", "Education", "Payment_History", "Employment_Status",
            "Residence_Type", "Marital_Status"]:
    print(col, "->", df[col].unique())

Gender -> <StringArray>
['Female', 'Male']
Length: 2, dtype: str
Education -> <StringArray>
['Master', 'High School', 'PhD', 'Bachelor']
Length: 4, dtype: str
Payment_History -> <StringArray>
['Bad', 'Good', 'Average']
Length: 3, dtype: str
Employment_Status -> <StringArray>
['Unemployed', 'Employed', 'Self-Employed']
Length: 3, dtype: str
Residence_Type -> <StringArray>
['Rented', 'Mortgaged', 'Owned']
Length: 3, dtype: str
Marital_Status -> <StringArray>
['Single', 'Married', 'Divorced']
Length: 3, dtype: str

Дисбаланс классов, все str